# for ციკლით 20-ჯერ დაბეჭდეთ სახელი და გვარი
for i in range(20):
    print("მათე გურეშიძე")



# მომხმარებელს შეეკითხეთ რიცხვები და შეინახეთ ცვლადებში
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

# for ციკლით იტერაცია შევასრულოთ num1 და num2-ის დიაპაზონზე
for i in range(num1, num2 + 1):  # num2 + 1, რადგან range-ი არ მოიცავს საბოლოო მნიშვნელობას
    print(i**2)  # დაბეჭდეთ საიტერაციო ცვლადის კვადრატი




# მომხმარებელს შევატანინებთ რიცხვებს და შევინახავთ ცვლადებში
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))

# სტ. ცვლადი, რომელსაც 0-ს დავარეგულირებთ
sum_variable = 0

# for ციკლით, იტერაცია გავაკეთოთ num1 და num2-ის დიაპაზონზე
for i in range(num1, num2 + 1):  # num2 + 1, რადგან range-ი არ მოიცავს საბოლოო მნიშვნელობას
    print(f"კვადრატი: {i**2}")  # საიტერაციო ცვლადის კვადრატი
    print(f"სტ. ცვლადი + პირველი რიცხვი: {sum_variable + num1}")  # სტ. ცვლადი + პირველი რიცხვი
    print(f"სტ. ცვლადი + მეორე რიცხვი: {sum_variable + num2}")  # სტ. ცვლადი + მეორე რიცხვი
    print(f"სტ. ცვლადი * პირველი რიცხვი: {sum_variable * num1}")  # სტ. ცვლადი * პირველი რიცხვი
    print(f"სტ. ცვლადი * მეორე რიცხვი: {sum_variable * num2}")  # სტ. ცვლადი * მეორე რიცხვი
